; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-4-7)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	)
(:init
	(at plane1 city0)
	(= (capacity plane1) 7685)
	(= (fuel plane1) 444)
	(= (slow-burn plane1) 3)
	(= (fast-burn plane1) 6)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 3)
	(at plane2 city1)
	(= (capacity plane2) 13697)
	(= (fuel plane2) 839)
	(= (slow-burn plane2) 5)
	(= (fast-burn plane2) 10)
	(= (onboard plane2) 0)
	(= (zoom-limit plane2) 5)
	(at plane3 city3)
	(= (capacity plane3) 6812)
	(= (fuel plane3) 1346)
	(= (slow-burn plane3) 3)
	(= (fast-burn plane3) 8)
	(= (onboard plane3) 0)
	(= (zoom-limit plane3) 8)
	(at plane4 city5)
	(= (capacity plane4) 2367)
	(= (fuel plane4) 432)
	(= (slow-burn plane4) 1)
	(= (fast-burn plane4) 3)
	(= (onboard plane4) 0)
	(= (zoom-limit plane4) 6)
	(at person1 city0)
	(at person2 city4)
	(at person3 city2)
	(at person4 city0)
	(at person5 city5)
	(at person6 city3)
	(at person7 city2)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 872)
	(= (distance city0 city2) 774)
	(= (distance city0 city3) 917)
	(= (distance city0 city4) 514)
	(= (distance city0 city5) 788)
	(= (distance city1 city0) 872)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 947)
	(= (distance city1 city3) 996)
	(= (distance city1 city4) 795)
	(= (distance city1 city5) 801)
	(= (distance city2 city0) 774)
	(= (distance city2 city1) 947)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 591)
	(= (distance city2 city4) 693)
	(= (distance city2 city5) 834)
	(= (distance city3 city0) 917)
	(= (distance city3 city1) 996)
	(= (distance city3 city2) 591)
	(= (distance city3 city3) 0)
	(= (distance city3 city4) 945)
	(= (distance city3 city5) 992)
	(= (distance city4 city0) 514)
	(= (distance city4 city1) 795)
	(= (distance city4 city2) 693)
	(= (distance city4 city3) 945)
	(= (distance city4 city4) 0)
	(= (distance city4 city5) 572)
	(= (distance city5 city0) 788)
	(= (distance city5 city1) 801)
	(= (distance city5 city2) 834)
	(= (distance city5 city3) 992)
	(= (distance city5 city4) 572)
	(= (distance city5 city5) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at plane1 city3)
	(at plane2 city5)
	(at person1 city5)
	(at person2 city4)
	(at person3 city1)
	(at person4 city2)
	(at person5 city4)
	(at person6 city1)
	(at person7 city1)
	))

(:metric minimize (+ (* 2 (total-time))  (* 2 (total-fuel-used))))
)

; plan
1. (refuel plane1 city0)
   changed: (fuel plane1) from 444 to 7685
   goals met: 1 of 9
2. (fly plane1 city0 city3)
   deleted: (at plane1 city0)
   added: (at plane1 city3)
   changed: (total-fuel-used) from 0 to 2751, (fuel plane1) from 7685 to 4934
   goals met: 2 of 9
3. (refuel plane2 city1)
   changed: (fuel plane2) from 839 to 13697
   goals met: 2 of 9
4. (fly plane2 city1 city5)
   deleted: (at plane2 city1)
   added: (at plane2 city5)
   changed: (total-fuel-used) from 2751 to 6756, (fuel plane2) from 13697 to 9692
   goals met: 3 of 9
5. (board person5 plane2 city5)
   deleted: (at person5 city5)
   added: (in person5 plane2)
   changed: (onboard plane2) from 0 to 1
   goals met: 3 of 9
6. (board person6 plane1 city3)
   deleted: (at person6 city3)
   added: (in person6 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 3 of 9
7. (fly plane2 city5 city0)
   deleted: (at plane2 city5)
   added: (at plane2 city0)
   changed: (total-fuel-used) from 6756 to 10696, (fuel plane2) from 9692 to 5752
   goals met: 2 of 9
8. (board person1 plane2 city0)
   deleted: (at person1 city0)
   added: (in person1 plane2)
   changed: (onboard plane2) from 1 to 2
   goals met: 2 of 9
9. (board person4 plane2 city0)
   deleted: (at person4 city0)
   added: (in person4 plane2)
   changed: (onboard plane2) from 2 to 3
   goals met: 2 of 9
10. (fly plane2 city0 city4)
   deleted: (at plane2 city0)
   added: (at plane2 city4)
   changed: (total-fuel-used) from 10696 to 13266, (fuel plane2) from 5752 to 3182
   goals met: 2 of 9
11. (refuel plane2 city4)
   changed: (fuel plane2) from 3182 to 13697
   goals met: 2 of 9
12. (debark person5 plane2 city4)
   deleted: (in person5 plane2)
   added: (at person5 city4)
   changed: (onboard plane2) from 3 to 2
   goals met: 3 of 9
13. (fly plane2 city4 city2)
   deleted: (at plane2 city4)
   added: (at plane2 city2)
   changed: (total-fuel-used) from 13266 to 16731, (fuel plane2) from 13697 to 10232
   goals met: 3 of 9
14. (debark person4 plane2 city2)
   deleted: (in person4 plane2)
   added: (at person4 city2)
   changed: (onboard plane2) from 2 to 1
   goals met: 4 of 9
15. (zoom plane2 city2 city5)
   deleted: (at plane2 city2)
   added: (at plane2 city5)
   changed: (total-fuel-used) from 16731 to 25071, (fuel plane2) from 10232 to 1892
   goals met: 5 of 9
16. (debark person1 plane2 city5)
   deleted: (in person1 plane2)
   added: (at person1 city5)
   changed: (onboard plane2) from 1 to 0
   goals met: 6 of 9
17. (fly plane1 city3 city2)
   deleted: (at plane1 city3)
   added: (at plane1 city2)
   changed: (total-fuel-used) from 25071 to 26844, (fuel plane1) from 4934 to 3161
   goals met: 5 of 9
18. (board person7 plane1 city2)
   deleted: (at person7 city2)
   added: (in person7 plane1)
   changed: (onboard plane1) from 1 to 2
   goals met: 5 of 9
19. (board person3 plane1 city2)
   deleted: (at person3 city2)
   added: (in person3 plane1)
   changed: (onboard plane1) from 2 to 3
   goals met: 5 of 9
20. (fly plane1 city2 city3)
   deleted: (at plane1 city2)
   added: (at plane1 city3)
   changed: (total-fuel-used) from 26844 to 28617, (fuel plane1) from 3161 to 1388
   goals met: 6 of 9
21. (refuel plane1 city3)
   changed: (fuel plane1) from 1388 to 7685
   goals met: 6 of 9
22. (fly plane1 city3 city1)
   deleted: (at plane1 city3)
   added: (at plane1 city1)
   changed: (total-fuel-used) from 28617 to 31605, (fuel plane1) from 7685 to 4697
   goals met: 5 of 9
23. (debark person6 plane1 city1)
   deleted: (in person6 plane1)
   added: (at person6 city1)
   changed: (onboard plane1) from 3 to 2
   goals met: 6 of 9
24. (debark person7 plane1 city1)
   deleted: (in person7 plane1)
   added: (at person7 city1)
   changed: (onboard plane1) from 2 to 1
   goals met: 7 of 9
25. (debark person3 plane1 city1)
   deleted: (in person3 plane1)
   added: (at person3 city1)
   changed: (onboard plane1) from 1 to 0
   goals met: 8 of 9
26. (fly plane1 city1 city3)
   deleted: (at plane1 city1)
   added: (at plane1 city3)
   changed: (total-fuel-used) from 31605 to 34593, (fuel plane1) from 4697 to 1709
   goals met: 9 of 9
